# Concat Data Fames

In [1]:
import pandas as pd
india_weather=pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [2]:
import pandas as pd
us_weather=pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [3]:
df=pd.concat([india_weather,us_weather])        #Using 'concat()' function to concat two Data Frames
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [4]:
df_new=pd.concat([india_weather,us_weather],ignore_index=True)  #Use 'ignore_index=True' to do the indexing starting from 0.
df_new

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [5]:
df_new=pd.concat([india_weather,us_weather],keys=['india','us']) #Use 'keys=[]' function to create dictionary in that table with county name
df_new

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [6]:
df_new.loc["india"]                              #To get the data of Indian cities

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [7]:
df_new.loc['us']                                #To get the data of Us cities

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

# Concat Data Frames as Columns

In [14]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [16]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai",'banglore'],
    "windspeed": [7,12,9],
}, index=[1,0,2])
windspeed_df

       city  windspeed
1     delhi          7
0    mumbai         12
2  banglore          9

In [17]:
df_new=pd.concat([temperature_df,windspeed_df],axis=1) #Use 'axis=1' as an argument in 'concat()' function to to concat the Data Frames as columns
df_new

       city  temperature      city  windspeed
0    mumbai           32    mumbai         12
1     delhi           45     delhi          7
2  banglore           30  banglore          9

# Concat Data Frames with 'Series()' function

In [18]:
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [20]:
s=pd.Series(['Humid','Sunny',"Rain"],name='Event')
s

0    Humid
1    Sunny
2     Rain
Name: Event, dtype: object

In [21]:
df_new=pd.concat([temperature_df,s],axis=1)
df_new

       city  temperature  Event
0    mumbai           32  Humid
1     delhi           45  Sunny
2  banglore           30   Rain